agenticaiuw/hivemind/firmware/nrf9160/src/main.c
#include <errno.h>
#include <stdint.h>
#include <string.h>
#include <zephyr/device.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/fs/fs.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/util.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/sys/onoff.h>
#include <hal/nrf_gpio.h>
#include <hal/nrf_pwm.h>
#include <hal/nrf_egu.h>
#include <hal/nrf_dppi.h>
#include <helpers/nrfx_gppi.h>
#include <ff.h>

#include "audio_opus.h"
#include "pendant_cloud.h"

#define LED_NODE DT_ALIAS(led0)
#define BUTTON_NODE DT_ALIAS(sw0)
#define I2S_NODE DT_NODELABEL(i2s0)

/*
 * Adafruit SPH0645LM4H I2S microphone capture.
 *
 * The SPH0645 requires BCLK between 1.024 and 4.096 MHz with LRCLK at
 * exactly BCLK/64.  The nRF9160 I2S peripheral cannot produce a 64-BCLK
 * frame as master (its 24-bit maximum word size yields 48 BCLK), so the
 * capture path instead runs I2S in slave mode and generates both clocks
 * with PWM peripherals driven from the shared 16 MHz PCLK16M:
 *
 *   BCLK  = 16 MHz / 8   = 2.000 MHz on P0.16 (A2), jumpered to P0.18
 *   LRCLK = 16 MHz / 512 = 31.25 kHz on P0.14 (A0), jumpered to P0.17
 *
 * Both PWMs start in the same clock cycle through one DPPI channel, so
 * LRCLK edges always land on BCLK falling edges as I2S requires.  The
 * mic (SEL grounded) drives the left slot; each RX word arrives as one
 * right-aligned, sign-extended 24-bit sample with 18 significant bits.
 * Adjacent frames are averaged down to a 15,625 Hz mono upload stream.
 */
#define MIC_BCLK_PIN 16U
#define MIC_LRCLK_PIN 14U
#define MIC_DATA_PIN 20U
/* Bus-side I2S clock pins, jumpered to the PWM outputs above. */
#define MIC_I2S_LRCK_PIN 17U
#define MIC_I2S_SCK_PIN 18U
#define MIC_BCLK_TOP 8U
#define MIC_LRCLK_TOP 512U
#define MIC_FRAME_RATE 31250U
#define MIC_DECIMATION 2U
#define SAMPLE_RATE (MIC_FRAME_RATE / MIC_DECIMATION)

#define MIC_RX_BLOCK_FRAMES 640U
#define MIC_RX_BLOCK_SIZE (MIC_RX_BLOCK_FRAMES * sizeof(int32_t))
/*
 * RX slab is dedicated so the 30 KiB Opus workspace can hold the live encoder
 * while the user is speaking. Six blocks provide about 123 ms total buffering;
 * the live-codec budget below reserves two blocks so PCM capture cannot be
 * killed by an encoder that is slower than real time.
 */
#define MIC_RX_BLOCK_COUNT 6U
#define MIC_OUT_BLOCK_FRAMES (MIC_RX_BLOCK_FRAMES / MIC_DECIMATION)
#define MIC_STAGE_FRAMES 512U
#define MIC_STAGE_BYTES (MIC_STAGE_FRAMES * sizeof(int16_t))
/*
 * Live TX is streaming Opus (SILK-WB, ~16 kbps, 20 ms frames): measured
 * real-world LTE-M here sustains only 24-55 kbps each way, which starves
 * even 64 kbps μ-law. Workspace layout during capture: encoder arena at the
 * front, wire-framed packet FIFO ([u16 BE length][packet]) in the rest —
 * ~13 KiB of FIFO holds ≈6 s of encoded speech.
 */
#define OPUS_TX_ARENA_BYTES (17U * 1024U)
#define OPUS_TX_FIFO_BYTES \
	(PENDANT_AUDIO_WORKSPACE_BYTES - OPUS_TX_ARENA_BYTES)
/* Batch ≥3 packets per HTTP chunk so TLS/TCP overhead amortizes (~60 ms). */
#define LIVE_TX_BATCH_BYTES 120U
#define LIVE_TX_WRITE_MAX 512U
/* Max LTE work per capture block so I2S DMA never starves. */
/* Slightly more LTE work per I2S block to keep the ring drained. */
#define PCM_TX_PUMP_BUDGET_MS 5U
#define PCM_TX_DRAIN_BUDGET_MS 12U
#define MAX_RECORD_SECONDS 30U
#define MAX_RECORD_SAMPLE_COUNT (SAMPLE_RATE * MAX_RECORD_SECONDS)
#define AUTORECORD_TEST_SECONDS 5U
#define AUTORECORD_TEST_SAMPLE_COUNT \
	(SAMPLE_RATE * AUTORECORD_TEST_SECONDS)
/* SPH0645 t_powerup is ≤50 ms once BCLK runs; only remainder is slept. */
#define MIC_POWERUP_BUDGET_MS 50
/* Discard the first RX block: slave sync and DMA-start artifacts. */
#define MIC_STARTUP_SKIP_BLOCKS 1U
/* Keep clocks alive briefly after DROP so I2S can reach STOPPED. */
#define MIC_STOP_SETTLE_MS 12
#define MIC_MIN_RECORD_FRAMES SAMPLE_RATE
/*
 * End-of-utterance detection: speak, pause ~1.5 s, and the turn ends — no
 * second button press. Thresholds ride the recording's own measured noise
 * floor (quietest stage so far), not fixed levels, so mic gain and room
 * noise calibrate themselves per press.
 */
#define SILENCE_STOP_MS 1500U
#define SILENCE_STOP_STAGES \
	((SILENCE_STOP_MS * SAMPLE_RATE) / (MIC_STAGE_FRAMES * 1000U) + 1U)
/* ~260 ms of clearly-voiced audio before silence can end the turn. */
#define VOICED_STAGES_REQUIRED 8U
/* Accidental press with no speech at all: stop after 6 s, not 30. */
#define NO_SPEECH_STOP_SECONDS 6U
/* One-pole DC blocker, y[n] = x[n] - x[n-1] + a*y[n-1], a = 0.995. */
#define MIC_HPF_COEFF_Q15 32604
/* Digital gain standing in for the PDM peripheral's former +12 dB. */
#define MIC_GAIN 4
/*
 * The SPH0645 launches data on the rising BCLK edge instead of the
 * standard falling edge.  If captures come back doubled or wrapped, the
 * receiver latched one bit early: set this to 1 to halve each raw word.
 */
#define MIC_SAMPLE_SHIFT 0
/*
 * Impulse rejector: microSD SPI bursts can couple into the mic lines on
 * the breadboard and flip a high bit in isolated samples, which lands as
 * a full-scale click at the flush cadence.  Real audio from this mic
 * cannot slew more than a small fraction of full scale in one 32 us
 * sample, so clamp per-sample deltas in the raw 24-bit domain.  1/8 of
 * full scale per sample passes every legitimate signal untouched.
 */
#define MIC_SLEW_LIMIT (1 << 20)
#define MIC_RAW_PROBE_BITS 2048U
/* The DPPIC is node 0 of the generic PPI helper on this device. */
#define MIC_GPPI_NODE 0U

#define I2S_BLOCK_FRAMES 256U
#define I2S_CHANNEL_COUNT 2U
#define I2S_BLOCK_SIZE \
	(I2S_BLOCK_FRAMES * I2S_CHANNEL_COUNT * sizeof(int16_t))
/* Cut from 16 to free RAM for live Opus + dedicated mic RX. */
#define I2S_BLOCK_COUNT 4U
#define I2S_PREFILL_BLOCKS 3U
#define I2S_SYNC_PATTERN_BLOCKS 2U
#define I2S_SYNC_END_FRAMES 16U
#define I2S_STREAM_SYNC_A 0x2468
#define I2S_STREAM_SYNC_B 0x5A5A
#define I2S_STREAM_SYNC_END 0x6C6C

#define SD_MOUNT_POINT "/SD:"
#define SD_RECORDING_PATH SD_MOUNT_POINT "/latest.pcm"
#define SD_OPUS_PATH SD_MOUNT_POINT "/latest.opus"
#define SD_SELFTEST_PCM_PATH SD_MOUNT_POINT "/selftest.pcm"
#define SD_SELFTEST_OPUS_PATH SD_MOUNT_POINT "/selftest.opus"
#define SD_TEST_PATH SD_MOUNT_POINT "/power_test.bin"
#define SD_TEST_MAGIC 0x53445631U
#define SD_TEST_CHECK_XOR 0xA55A39C3U

/* Boot upload stresses encode+LTE at once; keep off for stable bring-up. */
#define PENDANT_BOOT_UPLOAD_EXISTING 0
/* Temporary diagnostic: record five seconds automatically before LTE init. */
#define PENDANT_BOOT_AUTORECORD_TEST 0
/* Temporary diagnostic: exercise one complete post-LTE voice cycle. */
#define PENDANT_BOOT_AUDIO_CYCLE_TEST 0
/*
 * Stack self-test: encode a synthetic strongly voiced tone at boot.
 *
 * The deepest libopus stack path is silk_pitch_analysis_core's stage-3
 * contour search, and its two 1920-byte VLAs sit behind the "a pitch
 * candidate was found" branch - a silent or noise-only recording returns
 * early and never touches them, so it cannot validate the stack budget.
 * A 125 Hz sawtooth is unambiguously voiced and forces that branch, which
 * makes the high-water number printed afterwards meaningful.  Needs no
 * microphone, no button and no network.  Leave at 0; set to 1 to re-measure
 * after touching CONFIG_MAIN_STACK_SIZE, the opus complexity setting, or
 * OPUS_FRAME_MS.
 *
 * Last measured on hardware: peak=25396 of 32768 bytes, 7372 free.
 */
#define PENDANT_BOOT_ENCODE_SELFTEST 0
#define SELFTEST_PITCH_PERIOD_SAMPLES 125U
#define SELFTEST_AMPLITUDE 9000
#define SELFTEST_SECONDS 3U
/* Temporary diagnostic: emit the saved raw PCM as delimited hex on USB. */
#define PENDANT_BOOT_DUMP_PCM_HEX 0
/* Temporary diagnostic: prove whether the microphone actively drives DOUT. */
#define PENDANT_MIC_ELECTRICAL_PROBE 0

static const struct gpio_dt_spec led =
	GPIO_DT_SPEC_GET(LED_NODE, gpios);
static const struct gpio_dt_spec button =
	GPIO_DT_SPEC_GET(BUTTON_NODE, gpios);
static struct gpio_callback button_callback;
static FATFS sd_fat_fs;
static struct fs_mount_t sd_mount = {
	.type = FS_FATFS,
	.mnt_point = SD_MOUNT_POINT,
	.fs_data = &sd_fat_fs,
	.flags = FS_MOUNT_FLAG_NO_FORMAT,
};

K_SEM_DEFINE(button_press_sem, 0, 1);

