agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Mic RX slab is dedicated. audio_workspace is the live PCM TX ring during
 * capture and the Opus decode workspace for reply playback.
 */
static struct k_mem_slab mic_rx_slab;
static uint8_t mic_rx_storage[MIC_RX_BLOCK_SIZE * MIC_RX_BLOCK_COUNT]
	__aligned(4);
static uint8_t audio_workspace[PENDANT_AUDIO_WORKSPACE_BYTES] __aligned(4);
BUILD_ASSERT(sizeof(mic_rx_storage) ==
		     MIC_RX_BLOCK_SIZE * MIC_RX_BLOCK_COUNT,
	     "mic RX storage size mismatch");
K_MEM_SLAB_DEFINE_STATIC(i2s_slab, I2S_BLOCK_SIZE, I2S_BLOCK_COUNT, 4);
/* Processed audio staged between microSD writes (~1 KiB stages). */
static int16_t mic_stage_samples[MIC_STAGE_FRAMES] __aligned(4);
static bool live_stream_failed;
/*
 * Ring saturated during live-only capture: the link fell ~4 s behind. End
 * the utterance with what the link carried instead of failing the cycle —
 * distinct from live_stream_failed, which means the socket itself died.
 */
static bool live_tx_saturated;
/* Defined below with the other capture globals. */
extern volatile bool recording_on_sd;

static int16_t ulaw_to_linear(uint8_t code)
{
	uint8_t u = (uint8_t)(~code);
	int32_t t = (((u & 0x0F) << 3) + 0x84) << ((u >> 4) & 0x07);

	return (int16_t)((u & 0x80U) ? (0x84 - t) : (t - 0x84));
}

/* Wire-framed Opus packet FIFO in the workspace tail (SPSC, byte ring). */
static size_t live_fifo_head;
static size_t live_fifo_tail;
static size_t live_fifo_count;
static bool live_tx_flush;

static inline uint8_t *live_fifo_storage(void)
{
	return audio_workspace + OPUS_TX_ARENA_BYTES;
}

static void live_fifo_reset(void)
{
	live_fifo_head = 0U;
	live_fifo_tail = 0U;
	live_fifo_count = 0U;
	live_tx_flush = false;
}

static void live_fifo_put(const uint8_t *data, size_t length)
{
	uint8_t *storage = live_fifo_storage();

	for (size_t i = 0U; i < length; ++i) {
		storage[live_fifo_head] = data[i];
		live_fifo_head = (live_fifo_head + 1U) % OPUS_TX_FIFO_BYTES;
	}
	live_fifo_count += length;
}

/* Encoder → FIFO. Saturation clips the utterance (never fails the cycle). */
static int live_opus_packet_sink(const uint8_t *packet, size_t packet_bytes)
{
	uint8_t prefix[2] = { (uint8_t)(packet_bytes >> 8),
			      (uint8_t)(packet_bytes & 0xFFU) };

	if (live_tx_saturated) {
		return 0;
	}
	if (2U + packet_bytes > OPUS_TX_FIFO_BYTES - live_fifo_count) {
		printk("Live TX FIFO saturated; ending utterance with what "
		       "the link carried\n");
		live_tx_saturated = true;
		return 0;
	}
	live_fifo_put(prefix, 2U);
	live_fifo_put(packet, packet_bytes);
	return 0;
}

/*
 * Feed one PCM stage into the live Opus encoder (packets land in the FIFO
 * via the sink). Encoding a 20 ms frame at complexity 1 fits the gap between
 * I2S DMA blocks; the FIFO absorbs LTE stalls.
 */
static void live_tx_offer_stage(const int16_t *samples, size_t frame_count)
{
	int error;

	if (live_stream_failed || live_tx_saturated ||
	    !pendant_cloud_stream_active() || !pendant_opus_stream_active()) {
		return;
	}
	error = pendant_opus_stream_feed(samples, frame_count);
	if (error != 0) {
		printk("Live Opus feed failed: %d\n", error);
		pendant_cloud_stream_abort();
		live_stream_failed = true;
	}
}

static void live_tx_pump(uint32_t budget_ms)
{
	int64_t deadline;
	int error;

	if (live_stream_failed || !pendant_cloud_stream_active()) {
		return;
	}

	deadline = k_uptime_get() + (int64_t)budget_ms;
	while (k_uptime_get() < deadline) {
		if (pendant_cloud_stream_has_pending()) {
			error = pendant_cloud_stream_pump(1U);
			if (error == -EAGAIN) {
				return;
			}
			if (error != 0) {
				printk("Live TX pump failed: %d\n", error);
				pendant_cloud_stream_abort();
				live_stream_failed = true;
				live_fifo_reset();
				return;
			}
			continue;
		}

		if (live_fifo_count == 0U ||
		    (!live_tx_flush && live_fifo_count < LIVE_TX_BATCH_BYTES)) {
			return;
		}

		/* stream_write copies into its own pending buffer, so the
		 * FIFO bytes can be consumed as soon as the queue accepts. */
		uint8_t staging[LIVE_TX_WRITE_MAX];
		uint8_t *storage = live_fifo_storage();
		size_t batch = MIN(live_fifo_count, sizeof(staging));

		for (size_t i = 0U; i < batch; ++i) {
			staging[i] = storage[(live_fifo_tail + i) %
					     OPUS_TX_FIFO_BYTES];
		}
		error = pendant_cloud_stream_write(staging, batch);
		if (error == -EAGAIN) {
			return;
		}
		if (error != 0) {
			printk("Live TX write failed: %d\n", error);
			pendant_cloud_stream_abort();
			live_stream_failed = true;
			live_fifo_reset();
			return;
		}
		live_fifo_tail = (live_fifo_tail + batch) % OPUS_TX_FIFO_BYTES;
		live_fifo_count -= batch;
	}
}

/*
 * Main-thread stack high-water reporting.
 *
 * libopus is compiled with -DVAR_ARRAYS, so every codec scratch buffer is a
 * VLA on this thread's stack; the deepest one (silk_pitch_analysis_core)
 * previously ran the 24 KiB main stack off its PSPLIM guard mid-encode.  There
 * is no way to size the stack honestly without a real high-water number, so
 * report one after each encode.  CONFIG_INIT_STACKS fills the stack with 0xAA
 * at boot and costs no RAM; k_thread_stack_space_get() then counts the bytes
 * still untouched.
 */
static void report_main_stack_headroom(const char *phase)
{
#ifdef CONFIG_INIT_STACKS
	size_t unused = 0U;
	int error = k_thread_stack_space_get(k_current_get(), &unused);

	if (error != 0) {
		printk("Main stack usage (%s): unavailable (%d)\n", phase,
		       error);
		return;
	}
	printk("Main stack usage (%s): peak=%u free=%u size=%u\n", phase,
	       (unsigned int)(CONFIG_MAIN_STACK_SIZE - unused),
	       (unsigned int)unused, (unsigned int)CONFIG_MAIN_STACK_SIZE);
#else
	ARG_UNUSED(phase);
#endif
}

/* PWM duty words: bit 15 clear means the output is low first, so BCLK
 * rises mid-period (tick 4 of 8) while LRCLK edges (tick 0 mod 256) sit
 * on BCLK falling edges, and LRCLK starts low = left slot first.
 * Sequences must live in data RAM for EasyDMA.
 */
static uint16_t mic_bclk_duty[1] __aligned(4) = { MIC_BCLK_TOP / 2U };
static uint16_t mic_lrclk_duty[1] __aligned(4) = { MIC_LRCLK_TOP / 2U };
/* Held while the mic clocks run so PCLK16M is crystal-accurate. */
static struct onoff_manager *mic_hfclk_mgr;
/*
 * DPPI channel for phase-locked PWM starts, allocated through the
 * shared nrfx allocator.  Never hardcode one: the UART console's
 * enhanced poll-out already owns the topmost channel, and disabling
 * someone else's channel wedges that peripheral permanently.
 */
static int mic_dppi_channel = -1;

volatile int audio_cycle_result = -9999;
volatile uint8_t audio_cycle_phase;
volatile uint32_t recorded_samples;
volatile uint16_t recorded_peak;
volatile bool recording_stopped_by_button;
volatile bool sd_ready;
volatile bool recording_on_sd;
volatile int sd_mount_result = -9999;
volatile uint64_t recording_absolute_sum;
volatile bool sd_persistence_verified;
volatile uint32_t sd_boot_count;
volatile int sd_test_read_result = -9999;
volatile int sd_test_write_result = -9999;

