agenticaiuw/hivemind/firmware/nrf9160/src/main.c
static void button_pressed(const struct device *port,
			   struct gpio_callback *callback,
			   gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&button_press_sem);
}

static void clear_button_events(void)
{
	while (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
	}
}

static void finish_button_press(void)
{
	/* gpio_pin_get_dt() returns the logical active state. */
	while (gpio_pin_get_dt(&button) > 0) {
		k_msleep(5);
	}
	k_msleep(15);
	clear_button_events();
}

static bool consume_button_event(void)
{
	if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
		finish_button_press();
		return true;
	}
	return false;
}

static void wait_for_button_press(void)
{
	/*
	 * Latency-first: start work on the active edge. Do not wait for the
	 * physical release — that used to add hundreds of ms before the mic
	 * even powered up.
	 *
	 * While idle, wake every 5 s to check the half-open live stream. With
	 * STREAM_MAX_IDLE_MS at 12 s this refreshes on every third wake (~15 s
	 * cadence): sockets are rebuilt before Cloudflare's ~20 s idle kill but
	 * NOT unconditionally on every wake — the wake period must stay below
	 * the idle threshold or every wake tears down TLS + a Realtime session.
	 */
	while (k_sem_take(&button_press_sem, K_SECONDS(5)) != 0) {
		(void)pendant_cloud_stream_prewarm(PENDANT_OPUS_SAMPLE_RATE);
	}
	clear_button_events();
}

static void flash_led(unsigned int count, int on_ms, int off_ms)
{
	for (unsigned int flash = 0U; flash < count; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(on_ms);
		gpio_pin_set_dt(&led, 0);
		k_msleep(off_ms);
	}
}

/*
 * Solid LED = first speech batch on device (may still be downloading more).
 * Never autoplay — button 1 starts I2S → ESP32 → Bose.
 */
void pendant_notify_reply_first_batch(void)
{
	gpio_pin_set_dt(&led, 1);
	printk("First speech batch ready — solid LED; press button 1 to play "
	       "(no autoplay; download may still be finishing)\n");
}

static void wait_for_reply_playback_press(void)
{
	/* LED may already be solid from pendant_notify_reply_first_batch(). */
	if (!pendant_cloud_reply_first_batch) {
		gpio_pin_set_dt(&led, 1);
		printk("Reply complete — solid LED; press button 1 to play "
		       "(no autoplay)\n");
	} else {
		printk("Waiting for play press (LED already solid from first "
		       "speech batch)\n");
	}
	wait_for_button_press();
}

static int mount_sd_card(void)
{
	int error = -EIO;

	for (unsigned int attempt = 0U; attempt < 5U; ++attempt) {
		error = fs_mount(&sd_mount);
		if (error == 0) {
			break;
		}
		k_msleep(200);
	}
	sd_mount_result = error;
	sd_ready = error == 0;
	return error;
}

static int dump_sd_recording_hex(void)
{
	static const char digits[] = "0123456789abcdef";
	struct fs_file_t file;
	uint8_t bytes[48];
	char line[sizeof(bytes) * 2U + 1U];
	uint32_t total = 0U;
	int error;

	fs_file_t_init(&file);
	error = fs_open(&file, SD_RECORDING_PATH, FS_O_READ);
	if (error != 0) {
		printk("PCM_HEX_ERROR open=%d\n", error);
		return error;
	}

	printk("PCM_HEX_BEGIN\n");
	while (true) {
		ssize_t count = fs_read(&file, bytes, sizeof(bytes));

		if (count < 0) {
			error = (int)count;
			break;
		}
		if (count == 0) {
			error = 0;
			break;
		}

		for (size_t index = 0U; index < (size_t)count; ++index) {
			line[index * 2U] = digits[bytes[index] >> 4];
			line[index * 2U + 1U] = digits[bytes[index] & 0x0fU];
		}
		line[(size_t)count * 2U] = '\0';
		printk("%s\n", line);
		total += (uint32_t)count;
		/*
		 * The 115200-baud DK virtual UART needs about 8.5 ms to carry
		 * one full 48-byte hex line.  Pace this diagnostic stream so
		 * the interface MCU cannot drop bytes while draining printk.
		 */
		k_msleep(12);
	}
	(void)fs_close(&file);
	printk("PCM_HEX_END bytes=%u error=%d\n", total, error);
	return error;
}

struct sd_test_record {
	uint32_t magic;
	uint32_t boot_count;
	uint32_t checksum;
};

static uint32_t sd_test_checksum(const struct sd_test_record *record)
{
	return record->magic ^ record->boot_count ^ SD_TEST_CHECK_XOR;
}

static uint32_t integer_square_root(uint64_t value)
{
	uint64_t result = 0U;
	uint64_t bit = (uint64_t)1U << 62;

	while (bit > value) {
		bit >>= 2;
	}
	while (bit != 0U) {
		if (value >= result + bit) {
			value -= result + bit;
			result = (result >> 1) + bit;
		} else {
			result >>= 1;
		}
		bit >>= 2;
	}
	return (uint32_t)result;
}

static int test_sd_persistence(void)
{
	struct fs_file_t file;
	struct sd_test_record record = { 0 };
	int error;

	sd_persistence_verified = false;
	sd_boot_count = 0U;
	fs_file_t_init(&file);

	error = fs_open(&file, SD_TEST_PATH, FS_O_READ);
	sd_test_read_result = error;
	if (error == 0) {
		ssize_t bytes_read = fs_read(&file, &record, sizeof(record));

		sd_test_read_result = bytes_read == (ssize_t)sizeof(record)
			? 0 : (bytes_read < 0 ? (int)bytes_read : -EIO);
		(void)fs_close(&file);
		if (sd_test_read_result == 0 &&
		    record.magic == SD_TEST_MAGIC &&
		    record.checksum == sd_test_checksum(&record)) {
			sd_persistence_verified = true;
			sd_boot_count = record.boot_count;
		}
	}

	record.magic = SD_TEST_MAGIC;
	record.boot_count = sd_boot_count + 1U;
	record.checksum = sd_test_checksum(&record);

	fs_file_t_init(&file);
	error = fs_open(&file, SD_TEST_PATH,
			FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
	if (error == 0) {
		ssize_t written = fs_write(&file, &record, sizeof(record));

		error = written == (ssize_t)sizeof(record)
			? fs_sync(&file)
			: (written < 0 ? (int)written : -EIO);
		int close_error = fs_close(&file);
		if (error == 0) {
			error = close_error;
		}
	}

	sd_test_write_result = error;
	if (error == 0) {
		sd_boot_count = record.boot_count;
	}
	return error;
}

static int write_pcm_frames(struct fs_file_t *file,
			    const int16_t *samples,
			    size_t frame_count)
{
	const uint8_t *bytes = (const uint8_t *)samples;
	size_t bytes_remaining = frame_count * sizeof(int16_t);

	while (bytes_remaining > 0U) {
		ssize_t written = fs_write(file, bytes, bytes_remaining);

		if (written < 0) {
			return (int)written;
		}
		if (written == 0) {
			return -EIO;
		}
		bytes += (size_t)written;
		bytes_remaining -= (size_t)written;
	}

