agenticaiuw/hivemind/firmware/nrf9160/src/main.c
			int32_t sample = ((first + second) / 2) >> 8;

			/* DC blocker: the SPH0645 sits about 5% off center. */
			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered = sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >> 15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);

			int32_t absolute =
				amplified < 0 ? -amplified : amplified;

			mic_stage_samples[stage_frames] = (int16_t)amplified;
			stage_abs_sum += (uint32_t)absolute;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				if (sd_open) {
					live_write_error = write_pcm_frames(
						&sd_file, mic_stage_samples,
						MIC_STAGE_FRAMES);
					if (live_write_error != 0) {
						printk("microSD stage write failed: %d\n",
						       live_write_error);
						(void)fs_close(&sd_file);
						sd_open = false;
						recording_on_sd = false;
						live_write_error = 0;
					}
				}
				live_tx_offer_stage(mic_stage_samples,
						    MIC_STAGE_FRAMES);
				stage_frames = 0U;
				++stage_flush_count;

				/*
				 * End-of-utterance: floor tracks the quietest
				 * stage; voiced/silent split rides that floor,
				 * so levels self-calibrate per press.
				 */
				uint32_t stage_mean =
					stage_abs_sum / MIC_STAGE_FRAMES;

				stage_abs_sum = 0U;
				noise_floor_mean = MIN(noise_floor_mean,
						       MAX(stage_mean, 8U));
				if (stage_mean >
				    MAX(noise_floor_mean * 4U, 200U)) {
					++voiced_stage_count;
					silent_stage_count = 0U;
				} else if (stage_mean <
					   MAX(noise_floor_mean * 2U, 100U)) {
					++silent_stage_count;
				}
				if (sample_index >= MIC_MIN_RECORD_FRAMES) {
					if (voiced_stage_count >=
						    VOICED_STAGES_REQUIRED &&
					    silent_stage_count >=
						    SILENCE_STOP_STAGES) {
						recording_stopped_by_silence =
							true;
					} else if (voiced_stage_count == 0U &&
						   sample_index >=
							   SAMPLE_RATE *
								   NO_SPEECH_STOP_SECONDS) {
						/* Accidental press: no speech. */
						recording_stopped_by_silence =
							true;
					}
				}
				if (recording_stopped_by_silence ||
				    live_tx_saturated) {
					break;
				}
				/* Live mid-fail is OK if SD still capturing. */
				if (live_stream_failed && !sd_open) {
					break;
				}
			}
			minimum_sample = MIN(minimum_sample,
					     (int16_t)amplified);
			maximum_sample = MAX(maximum_sample,
					     (int16_t)amplified);
			square_sum += (uint64_t)((int64_t)amplified *
						 amplified);
			if (have_previous_sample &&
			    ((previous_sample < 0 && amplified >= 0) ||
			     (previous_sample >= 0 && amplified < 0))) {
				++zero_crossings;
			}
			previous_sample = (int16_t)amplified;
			have_previous_sample = true;
			recorded_peak = MAX(recorded_peak,
					    (uint16_t)MIN(absolute,
							  UINT16_MAX));
			recording_absolute_sum += (uint32_t)absolute;

			++sample_index;
		}

		recorded_samples = sample_index;
		if (live_stream_failed && !sd_open) {
			printk("I2S mic live LTE stream failed mid-capture "
			       "(no SD backup)\n");
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			if (sd_open) {
				(void)fs_close(&sd_file);
				recording_on_sd = false;
			}
			return -EIO;
		}
		if (live_stream_failed && sd_open && !live_fail_logged) {
			printk("Live LTE failed mid-capture; continuing on microSD\n");
			live_fail_logged = true;
		}

		/* Spend a few free ms pushing PCM over LTE between DMA blocks. */
		if (!live_stream_failed) {
			live_tx_pump(PCM_TX_PUMP_BUDGET_MS);
		}

		if (sample_index >= next_trace_sample) {
			next_trace_sample += SAMPLE_RATE;
		}

		if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		if (recording_stopped_by_silence) {
			printk("End of utterance: %s (voiced_stages=%u)\n",
			       voiced_stage_count > 0U
				       ? "silence after speech"
				       : "no speech detected",
			       voiced_stage_count);
			break;
		}
		if (live_tx_saturated) {
			printk("Utterance clipped: uplink fell ~4 s behind\n");
			break;
		}

		/*
		 * Ignore bounce / leftover edges from the start press for the
		 * first second, then a second press stops recording.
		 */
		if (sample_index < MIC_MIN_RECORD_FRAMES) {
			clear_button_events();
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
			recording_stopped_by_button = true;
			break;
		}
	}

	error = i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
	k_msleep(MIC_STOP_SETTLE_MS);
	mic_clocks_stop();
	if (recording_stopped_by_button) {
		finish_button_press();
	}

	if (stage_frames > 0U) {
		if (sd_open) {
			live_write_error = write_pcm_frames(
				&sd_file, mic_stage_samples, stage_frames);
			if (live_write_error != 0) {
				printk("microSD final stage write failed: %d\n",
				       live_write_error);
			}
		}
		/* Pad last stream slot so the fixed-size ring accepts it. */
		while (stage_frames < MIC_STAGE_FRAMES) {
			mic_stage_samples[stage_frames++] = 0;
		}
		live_tx_offer_stage(mic_stage_samples, MIC_STAGE_FRAMES);
	}

	if (sd_open) {
		int sync_error = fs_sync(&sd_file);
		int close_error = fs_close(&sd_file);

		sd_open = false;
		if (sync_error != 0 || close_error != 0) {
			printk("microSD close failed: sync=%d close=%d\n",
			       sync_error, close_error);
			recording_on_sd = false;
		}
	}

	/* Finalize the live encoder (flushes the last partial packet through
	 * the sink), then drain the FIFO — it can hold ~6 s of encoded audio;
	 * give a weak uplink time to move it. */
	if (pendant_opus_stream_active()) {
		struct pendant_opus_stats live_stats = { 0 };
		int end_error = pendant_opus_stream_end(&live_stats);

		if (end_error != 0) {
			printk("Live Opus finalize failed: %d\n", end_error);
		} else {
			printk("Live Opus: packets=%u bytes=%u\n",
			       live_stats.packets, live_stats.output_bytes);
		}
	}
	if (pendant_cloud_stream_active() && !live_stream_failed) {
		int64_t drain_until = k_uptime_get() + 6000;

		live_tx_flush = true;
		while ((live_fifo_count > 0U ||
			pendant_cloud_stream_has_pending()) &&
		       pendant_cloud_stream_active() && !live_stream_failed &&
		       k_uptime_get() < drain_until) {
			live_tx_pump(PCM_TX_DRAIN_BUDGET_MS);
		}
		if (live_stream_failed || !pendant_cloud_stream_active()) {
			printk("Live TX incomplete — will use SD fallback if present\n");
			pendant_cloud_stream_abort();
			live_stream_failed = true;
			live_fifo_reset();
		} else if (pendant_cloud_stream_has_pending()) {
			/* A half-sent HTTP chunk cannot be abandoned without
			 * corrupting the chunked framing — abort cleanly. */
			printk("Live TX pending chunk stuck; abort stream\n");
			pendant_cloud_stream_abort();
			live_stream_failed = true;
			live_fifo_reset();
		} else if (live_fifo_count > 0U) {
			/* Socket healthy but slow: clip the utterance tail and
			 * let the model answer on what arrived. */
			printk("Live TX drain timeout; clipping %u undelivered "
			       "bytes\n",
			       (uint32_t)live_fifo_count);
			live_fifo_reset();
		}
	}

