agenticaiuw/hivemind/firmware/nrf9160/src/main.c
		/*
		 * Prefer live chunked POST; fall back to microSD single-shot
		 * when prewarm failed, live TX aborted, or stream_end fails.
		 */
		audio_cycle_phase = 3U;
		{
			uint32_t pcm_bytes =
				recorded_samples * (uint32_t)sizeof(int16_t);
			bool live_ok = pendant_cloud_stream_active() &&
				       !live_stream_failed &&
				       pendant_cloud_stream_bytes_sent() > 0U;

			error = -EIO;
			if (live_ok) {
				error = pendant_cloud_stream_end();
				printk("LAT live_stream_end_ms=%lld pcm_bytes=%u "
				       "result=%d\n",
				       k_uptime_get() - lat_press_started,
				       pendant_cloud_uploaded_pcm_bytes, error);
			} else if (pendant_cloud_stream_active()) {
				pendant_cloud_stream_abort();
			}

			if (error < 0 && recording_on_sd && pcm_bytes > 0U) {
				printk("Fallback SD PCM upload (%u bytes) "
				       "(live_result=%d live_sent=%u)\n",
				       pcm_bytes, error,
				       pendant_cloud_stream_bytes_sent());
				error = pendant_cloud_upload_recording(
					SD_RECORDING_PATH, pcm_bytes,
					SAMPLE_RATE);
				printk("LAT fallback_upload_ms=%lld "
				       "pcm_bytes=%u result=%d\n",
				       k_uptime_get() - lat_press_started,
				       pendant_cloud_uploaded_pcm_bytes, error);
			} else if (error < 0) {
				printk("Live stream dead and no SD backup "
				       "(pcm_bytes=%u recording_on_sd=%d)\n",
				       pcm_bytes, recording_on_sd ? 1 : 0);
				error = -EIO;
			}
		}
		report_main_stack_headroom("upload");
		printk("LAT press_to_upload_done_ms=%lld\n",
		       k_uptime_get() - lat_press_started);
		if (error == PENDANT_CLOUD_REPLY_INLINE) {
			/* Conversational path: the model's voice is already
			 * arriving on the upload socket — play it now. */
			audio_cycle_phase = 6U;
			gpio_pin_set_dt(&led, 1);
			printk("Conversational reply: autoplaying inline "
			       "stream\n");
			int play_error = play_inline_reply(i2s);

			pendant_cloud_reply_stream_close();
			gpio_pin_set_dt(&led, 0);
			printk("LAT inline_reply_done_ms=%lld result=%d\n",
			       k_uptime_get() - lat_press_started, play_error);
			/* The solid LED used to mean press-to-play; a press
			 * queued during autoplay must not start a recording. */
			clear_button_events();
			if (play_error != 0) {
				audio_cycle_result = play_error;
				flash_led(6U, 100, 100);
				continue;
			}
			goto reply_done;
		}
		if (error != 0) {
			printk("Internet voice cycle failed: %d "
			       "(transcribe=%d dispatch=%d HTTP=%d)\n",
			       error, pendant_cloud_transcribe_result,
			       pendant_cloud_dispatch_result,
			       pendant_cloud_last_http_status);
			audio_cycle_result = error;
			flash_led(5U, 100, 100);
			continue;
		}

		audio_cycle_phase = 4U;
		/*
		 * Waiting for agent speech: LED off until first batch arrives,
		 * then solid (pendant_notify_reply_first_batch). Never autoplay.
		 */
		gpio_pin_set_dt(&led, 0);
		printk("Waiting for agent speech (LED solid on first batch; "
		       "press button 1 to play as soon as it is solid)\n");
		error = pendant_cloud_wait_for_agent_reply(
			PENDANT_CLOUD_REPLY_AUDIO_PATH);
		if (error == -ECANCELED) {
			/* Button pressed while polling: skip this reply and
			 * go straight back to Ready for a new recording.
			 */
			printk("Reply wait canceled by button press\n");
			finish_button_press();
			gpio_pin_set_dt(&led, 0);
			continue;
		}
		const char *reply_pcm_path = PENDANT_CLOUD_REPLY_AUDIO_PATH;
		if (pendant_cloud_reply_format ==
		    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
			if (error != 0) {
				printk("Opus reply decode failed: %d\n", error);
				audio_cycle_result = error;
				flash_led(8U, 100, 100);
				continue;
			}
			pendant_cloud_reply_pcm_bytes =
				decode_stats.output_bytes;
			pendant_cloud_reply_sample_rate =
				PENDANT_OPUS_REPLY_SAMPLE_RATE;
			reply_pcm_path = PENDANT_CLOUD_REPLY_PCM_PATH;
		}
		if (error != 0) {
			printk("Agent reply download failed: %d (HTTP=%d)\n",
			       error, pendant_cloud_last_http_status);
			audio_cycle_result = error;
			flash_led(7U, 100, 100);
			continue;
		}

		/*
		 * Repeating pairs of short flashes mean the agent response is ready.
		 * A deliberate third button press starts Bluetooth playback.
		 */
		audio_cycle_phase = 5U;
		clear_button_events();
#if PENDANT_BOOT_AUDIO_CYCLE_TEST
		k_sem_give(&button_press_sem);
#endif
		wait_for_reply_playback_press();

		/* Playing: LED remains solid for the duration of agent speech. */
		audio_cycle_phase = 6U;
		gpio_pin_set_dt(&led, 1);
		int telemetry_error =
			pendant_cloud_report_playback_started();

		if (telemetry_error != 0) {
			printk("Playback-start telemetry failed: %d\n",
			       telemetry_error);
		}
		error = play_agent_reply(i2s, reply_pcm_path);
		telemetry_error =
			pendant_cloud_report_playback_result(error);
		if (telemetry_error != 0) {
			printk("Playback-result telemetry failed: %d\n",
			       telemetry_error);
		}
		gpio_pin_set_dt(&led, 0);
		if (error != 0) {
			printk("Agent reply I2S playback failed: %d\n", error);
			audio_cycle_result = error;
			flash_led(9U, 100, 100);
			continue;
		}

reply_done:
		audio_cycle_phase = 7U;
		audio_cycle_result = 0;
		for (unsigned int flash = 0U; flash < 3U; ++flash) {
			gpio_pin_set_dt(&led, 1);
			k_msleep(180);
			gpio_pin_set_dt(&led, 0);
			k_msleep(180);
		}
		k_msleep(200);
	}
}
